tsung_files/login.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="107.23.39.241" port="8000" type="tcp"></server>
</servers>


  <load duration="2" unit="minute">
   <arrivalphase phase="1" duration="2" unit="minute">
     <users maxnumber="100" arrivalrate="1" unit="second"></users>
   </arrivalphase>
  </load>
   

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
  </options>

   <sessions>
		<session name='login' probability='100'  type='ts_http'>
		<request><http url='http://107.23.39.241/' version='1.1' method='GET'></http></request>

		<request>
			<dyn_variable name="authenticity_token" ></dyn_variable> 
			<http url='/login' version='1.1' method='GET'></http>
		</request>

		<setdynvars sourcetype="random_number" start="1" end="1000">
		  <var name="user_num" />
		</setdynvars>

		<setdynvars sourcetype="random_number" start="1" end="10000">
		  <var name="product_num" />
		</setdynvars>


		<request>
			<http url='/assets/application-85f3e37588d64cdc8817d7a50fc3c1d80f51f2e0f103d0a60a467698fe9a7f28.css' version='1.1' method='GET'>
			</http>
		</request>

		<request>
			<http url='/assets/application-d3b407e8dc3d82934fb3d97690e3ef706d4d51c4871524fbc3f9fd4dbd1a731c.js' version='1.1' method='GET'>
			</http>
		</request>

		<request>
			<http url='http://fonts.googleapis.com/css?family=Lato:400,700' version='1.1' method='GET'>
			</http>
		</request>

		<thinktime random='true' value='13'/>

		<request>
			<http url='/login' version='1.1'  contents='utf8=%E2%9C%93&amp;authenticity_token=%%authenticity_token%%&amp;user%5Bname%5D=user%%user_num%%&amp;user%5Bemail%5D=user%%user_num%%%40gmail.com&amp;user%5Bpassword%5D=123456&amp;user%5Bpassword_confirmation%5D=123456&amp;commit=Sign+Up' content_type='application/x-www-form-urlencoded' method='POST'>
			</http>
		</request>

		</session>
	</sessions>
</tsung>